Autodesk.Revit.DB.Structure.IFramingProfileServerProxy.FramingProfileUpdate(Autodesk.Revit.DB.Structure.FramingProfileServiceData)
The server's method that will be called when Revit needs profile information for fabrication data cell.
The input and output data of the calculation.
Indicates whether the section type parameter server is executed successfully.
Remarks:
The method should always return 'true' if the server is successfully executed, no matter whether the server changes anything.
Return 'false' or if the server throws, indicates a failed case, all changes made by the server will be discarded.
Since:
2016